#!/usr/bin/env python3

# info contains (number, message, name, reply)
info = [
    (0.01,),
    (0.1, "你好 能加个朋友吗", '', "联系我可以向主页上的邮箱发邮件：）"),
    (10, "想问些问题不浪费时间"),
    (1,),
    (0.5,),
    (5,),
    (10, "谢谢"),
    (5, "谢谢你的帐号", '', "帐号全部来源于互联网大家的无私分享，请支持帐号来源：）"),
    (10, "谢大佬！请喝可乐"),
    (5,),
    (10,),
    (20,),
    (5,),
    (20,),
    (6.66,),
    (10,),
    (0.01,),
    (1,),
    (2,),
    (0.1,),
    (5,),
    (5, "还差一个y", "willyboyshy"),
    (5, "willyboysh", "willyboyshy"),
    (10, "可以的话加我微信", "willyboyshy"),
    (10, "一边让我卖，打持成本", "willyboyshy"),
    (10, "说能不能一边公益，", "willyboyshy"),
    (10, "的，无奈人数太少，想", "willyboyshy"),
    (10, "一起合作，我是开机场", "willyboyshy"),
    (10, "你好，我想请问能不能", "willyboyshy", "抱歉，我不做商业活动"),
    (0.12,),
    (2.33,),
    (15, "支持"),
    (1,),
    (2,),
    (1,),
    (2.33, "看起来很厉害"),
    (0.01, "我要80端口哪里买！"),
    (5,),
    (0.01,),
    (5, "感谢你的订阅源"),
    (1, "谢谢大佬"),
    (10, "感谢大佬的付出"),
    (6.66, "感谢老哥的ssr"),
    (5,),
    (2,),
    (5, "感谢分享"),
    (1,),
    (1,),
    (10, "谢谢你自由网络的贡献"),
    (10, "多谢分享！加油！"),
    (5,),
    (1, "谢谢分享"),
    (2,),
    (10, "感谢ss帐号"),
    (1,),
    (1,),
    (6.66, "谢谢", "微信15901219117"),
    (8.88, "感谢大佬"),
    (5,),
    (10, "还是学生，一点小心意"),
    (1,),
    (2.33, "大佬tg多少？"),
    (1,),
    (66.66,),
    (0.1,),
    (5, "谢谢"),
    (5,),
    (9, "今晚加个鸡腿吧！"),
    (0.5,),
    (6.66,),
    (4, "感谢", "淡定"),
    (10,),
    (10,),
    (1,),
    (1, "", "sz6101238"),
    (6.66,),
    (2,),
    (2.33,),
    (1,),
    (3, "成功了，感谢！"),
    (3,),
    (1, "感谢您的梯子～"),
    (1, "感谢分享"),
    (1, "加油继续做下去", "花郎"),
    (20, "", 'llyy7'),
    (5,),
    (1, "Thank you"),
    (10,),
    (8.88,),
    (5,),
    (10, '感谢分享，'),
    (3,),
    (3.14, '买瓶可乐吧，兄弟'),
    (1,),
    (1.11, 'saner'),
    (10, 'HOLD ON!'),
    (5.2, '谢谢分享'),
    (5, '大佬喝冰阔落'),
    (20, '支持一下 emoji:smile'),
    (6.66, '谢谢'),
    (10,),
    (1, '感谢大佬！'),
    (10,),
    (10, '支持'),
    (1,),
    (2, '万分感谢'),
    (8.88, '再接再励。'),
    (10, '谢谢你的努力'),
    (10, '很好用，点赞！'),
    (2.33, '牛批'),
    (1,),
    (1, '等发工资再捐'),
    (5, '老铁 奉献没毛病'),
    (2, '加油兄弟'),
    (1, '好用，点赞！继续保持'),
    (8.8, '聊表心意，钱不多。'),
    (10,),
    (10, '谢谢'),
    (10, '谢谢分享'),
    (10, '资助你大兄弟加油'),
    (1, '加油哦！Ծ̮Ծ'),
    (10,),
    (5, '779595014'),
    (3, 'Respect!'),
    (0.01,),
    (5, '支持技术！谢谢技术！'),
    (5, '感谢分享'),
    (20, '感谢分享，自由无价！'),
    (20, '请再接再厉，坚持完善'),
    (2,),
    (10, '谢谢分享！'),
    (0.88,),
    (3, '感谢你免费梯子项目'),
    (8.88,),
    (5,),
    (5,),
    (10.01, '伟大，感谢与支持！'),
    (1, '用不了了(emoji哭)不过还是', '', '具体是哪方面用不了了？欢迎到我的 <a target="_blank" href="https://github.com/the0demiurge/ShadowSocksShare-OpenShift/issues">GitHub Issue 页面</a>提供反馈；<br>此外近期有计划抽空对网站升级，把不能用的帐号过滤掉：）'),
    (10, ''),
    (10, '感谢分享～加油'),
    (8, '喝瓶奶茶'),
    (5, '老大，请你吃个可乐。'),
    (10, '感谢您的ss项目'),
    (2.33, '谢谢'),
    (1, ''),
    (10, '感谢分享免费梯子'),
    (2, ''),
    (50, '', 'hsu_bicheng'),
]


def parse(data):
    if len(data) == 1:
        number, message = data[0], ''
    else:
        number, message = data[:2]
    if message:
        message = '，并留言：”{}“'.format(message)
    if len(data) >= 3:
        name = data[2]
    else:
        name = '某位没有留下名字的'

    if len(data) >= 4:
        comment = '<br>to 这位朋友：{}'.format(data[3])
    else:
        comment = ''

    return_data = '<p>{name}朋友捐献了{number}元{message}：）{comment}</p>'.format(
        name=name,
        number=number,
        message=message,
        comment=comment)
    return return_data


sum_people = len(info)
sum_money = sum(list(zip(*info))[0])
data = '\n'.join(map(parse, info))


if __name__ == '__main__':
    print("sum_people: ", sum_people)
    print("sum_money: ", sum_money)
